Tekla.Structures.Drawing.PreferredMarkPlacingTypes
The PreferredMarkPlacingTypes class contains the available preferred mark placing types.
These are allowed to be used for marks.
However, there are different mark types and not all types can be used by all marks.
If you try to use the wrong type it will not be accepted (Insert, Modify will fail).

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.PointPlacingType
The object is placed at one point (the insertion point) without any additional placing options.
Returns: A new point placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.AlongLinePlacingType
The object is placed using the along line placing.
Returns: A new along line placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.AlongLineOrWithLeaderLinePlacingType
The object is placed using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
Returns: A new along line or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
The object is placed using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line and rotated to be at the same angle as the connected part.
Returns: A new along line or with leader line and parent object along part placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.AlongPartCenteredPlacingType
The object is placed using the along line placing.
The line used will be the part's edge in the center of that line.
Returns: A new along part centered placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.InsidePartAlongPartPlacingType
The object is placed using the base line placing.
The base line used is in the middle of the part, aligned with the part.
Returns: A new inside part along part placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.InsidePartAlongPartOrWithLeaderLinePlacingType
The object is placed using the base line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
The base line used is in the middle of the part, aligned with the part.
Returns: A new inside part along part or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.InsidePartHorizontalPlacingType
The object is placed using the base line placing.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.
Returns: A new inside part horizontal placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.InsidePartHorizontalOrWithLeaderLinePlacingType
The object is placed using the base line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.
Returns: A new inside part horizontal or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.LeaderLinePlacingType
The object is placed with a leader line.
Returns: A new leader line placing type instance.

Tekla.Structures.Drawing.PreferredMarkPlacingTypes.LeaderLineAndParentObjectAlongPartPlacingType
The object is placed with a leader line and rotated to be at the same angle as the connected part.
Returns: A new leader line and parent object along part placing type instance.